<?php
// for문 : 특정 처리를 반복적으로 구현하고자 할 시 사용

// 0~5까지 숫자를 출력하고 싶을 때
// 숫자n으로 수정하고 싶다면 다 바꿔줘야 한다 이걸 for로 해결 할 수 있다
// echo "0"."\n";
// echo "1"."\n";
// echo "2"."\n";
// echo "3"."\n";
// echo "4"."\n";
// echo "5"."\n";
// echo "6"."\n";

for($i = 0; $i === 5; $i++){
    // 우리가 반복하고 싶은 처리
    echo "숫자 : ".$i."\n";
}
// 안된이유 : 교육영상보기 1시간 시점

for($i = 0; $i < 6; $i++){
    // 만일 1부터 하고자 한다면 시작값을 0이아닌 1을 적어준다.
    // 현재 5까지 출력하고자 한다면 <=연산도 가능하다
    echo "숫자 : ".$i."\n";
}
echo "\n---\n";

// break중에 break를 만나면 루프 종료
// for($i = 1; $i<6; $i++){
//     // echo위에 있기 때문에 2까지 출력
//     // if($i === 3){ 
//     //     break;
//     // }
//     echo"숫자 : ". $i . "\n";

//     // echo아래 if문 문제 Q. 몇번까지 출력될까? 3
//     if($i === 3){
//         break;
//     }
// }


/** continue문 : 
 * 처리중에 continue를 만나면 이후의 처리를 건너뛰고 다음 루프를 진행 */
for($i = 1; $i<6; $i++){
    if(($i % 2) === 1){
    continue;
    }
    echo "숫자 : ".$i."\n";
}

echo "\n----------\n";

// // Q2. 구구단 출력하기 2X1=2.....2X9=18
for($i = 1; $i<=9; $i++){
    echo "2 X ".$i." = ".($i*2)."\n";
    // 계산된 연산자로 생각하기 때문에 소괄호가 필요하다
}
echo "\n----------\n";
for($i = 1; $i<=9; $i++){
    if((2*$i) === 0){
    continue;
    }
    echo "2 X ".$i."=".(2*$i)."\n";
}
echo "\n----------\n";
// T답안
for($i = 1; $i<=9; $i++){
    echo "2 X ".$i." = ".(2*$i)."\n";
}
echo "\n----------\n";

// 3단출력
$dan = 3;
for($i = 1; $i<=9; $i++){
    echo "$dan X ".$i." = ".($dan*$i)."\n";
}
/**
 * 다중루프문032
*/
// 이중루프
for($i=1;$i<3;$i++){
    echo "바깥 Loop문 : ".$i."\n";

    for($z = 1; $z<3; $z++){
        echo "안쪽 Loop문 : ".$z."\n";
    }
}
echo "\n----------\n";

// 곱하기
for($dan=2;$dan<=9;$dan++){
    echo "**".$dan."단**\n";

    for($multi = 1; $multi <= 9; $multi++){
        echo $dan." X ".$multi." = ".($dan*$multi)."\n";
    }
}
echo "\n----------\n";

// Q3. 한줄에 *****인 값을 5줄 표기하라
for($as=1; $as<6; $as++){
    echo "*****\n";
}
echo "\n----------\n";

for($as=1; $as<6; $as++){
    echo "*\n";
    // for($add = 1; $add <6; $as++){
    // }
    // echo $as."*\n";
}
echo "\n----------\n";

for($i=1;$i<6;$i++){
    for($z = 1; $z<$i; $z++){
        echo "*";
    }
    echo"\n";
}
echo "\n----------\n";

// 역삼각형(영상다시보기)
for($i=1;$i<6;$i++){
    echo"\n";
    for($z = 1; $z<$i; $z++){
        echo "*";
    }
    
}
echo "\n----------\n";
// 구구단 6단
$dan =6;
for($i=1; $i<10;$i++){
    echo $dan." X ".$i." = ".$dan*$i."\n";
}

for($dan = 1; $dan<=9; $dan++){
    echo $dan."단\n";{
        
    }
}